{
  "project_ecosystem": "Developed a complete e-commerce ecosystem using Flutter, consisting of a user app and an admin dashboard. Implemented Clean Architecture with Bloc and Get_it for scalable, maintainable flows. Integrated Firebase (Auth, Firestore) and Supabase for backend services, real-time data, and secure media handling. Enhanced UX with ScreenUtil, skeleton loading, and image caching, including full cart, checkout, and product management features.",
  "project_healthcare": "Developed a cross-platform healthcare app using Flutter with a clean, maintainable structure. Implemented secure authentication and efficient API integration using Dio and Retrofit. Enhanced performance and user experience with responsive design and smooth interactions.",
  "project_books": "Built a scalable book discovery app using Flutter with a clean and predictable architecture. Integrated APIs, managed state efficiently, and optimized navigation and dependency management. Enhanced the UI/UX with responsive layouts, smooth performance, and interactive features.",
  "project_nasa": "Developed the NASA Machine Learning App’s entire network layer, including all API integrations, optimization, and Dio setup. Built and structured all feature layers to ensure clean architecture, scalability, and efficient data flow across the app.",
  "mobile_app_development": "Building high-quality cross-platform mobile apps using Flutter with clean architecture and state management (Bloc & GetX).",
  "firebase_supabase_integration": "Integrating Firebase & Supabase services like Authentication, Firestore, Storage, and Notifications to build scalable backend-powered apps.",
  "ui_ux_design_implementation": "Translating modern UI/UX designs into responsive Flutter interfaces with smooth animations and excellent performance.",
  "ai_machine_learning_apps": "Creating smart applications powered by AI and ML models, integrating prediction and automation features with Flutter.",
  "About": "About",
  "Me": "Me",
  "Flutter Developer": "Flutter Developer",
  "abuot_info": "I am a Flutter Developer passionate about creating modern, high-quality mobile and web apps. I focus on clean code, scalability, and performance.",
  "See More": "See More",
  "Home": "Home",
  "About Me": "About",
  "Service": "Service",
  "Projects": "Projects",
  "Contact": "Contact",
  "HelloItsMe": "Hello it’s Me ",
  "Khaled Bahnawy": "Khaled Badr",
  "AndImA": "And I’m a",
  "FlutterDeveloperTag": "Flutter Developer </>",
  "brief_info": "Capable of turning business ideas into scalable, high-quality apps using various architectures. I work effectively in teams, follow best practices, and continuously learn new technologies.",
  "download_cv": "Download CV",
  "My Services 1": "My ",
  "My Services 2": "Services",
  "Mobile App Development": "Mobile App Development",
  "Firebase & Supabase Integration": "Firebase & Supabase Integration",
  "UI/UX Design Implementation": "UI/UX Design Implementation",
  "AI & Machine Learning Apps": "AI & Machine Learning Apps",
  "My Projects 1": "My ",
  "My Projects 2": "Projects",
  "hint": "Hint: Click on a project to see its repository",
  "services": "Services",
  "your_name": "Your Name",
  "your_email": "Your Email",
  "field_empty": "Field can't be empty",
  "enter_valid_email": "Enter a valid email",
  "your_message": "Your Message",
  "lets_work_together": "Let’s Work Together",
  "send_message": "Send Message"
}