{
    "project_ecosystem": "طوّرت نظام تجارة إلكترونية متكامل باستخدام Flutter، يتكوّن من تطبيق للمستخدم ولوحة تحكم للمشرف. تم تطبيق معمارية نظيفة باستخدام Bloc وGet_it لتحقيق قابلية التوسع وسهولة الصيانة. تم دمج Firebase (المصادقة وFirestore) وSupabase لتقديم خدمات الخلفية والبيانات في الوقت الفعلي وإدارة الوسائط بأمان. كما تم تحسين تجربة المستخدم باستخدام ScreenUtil، وتأثيرات التحميل الهيكلية، وتخزين الصور المؤقت، مع دعم كامل لعربة التسوق والدفع وإدارة المنتجات.",
    "project_healthcare": "تم تطوير تطبيق رعاية صحية متعدد المنصات باستخدام Flutter بهيكل نظيف وسهل الصيانة. تم تنفيذ مصادقة آمنة وتكامل فعّال مع واجهات برمجة التطبيقات باستخدام Dio وRetrofit. كما تم تحسين الأداء وتجربة المستخدم من خلال تصميم متجاوب وتفاعلات سلسة.",
    "project_books": "تم بناء تطبيق لاكتشاف الكتب قابل للتوسع باستخدام Flutter بمعمارية نظيفة ويمكن التنبؤ بها. تم دمج واجهات برمجة التطبيقات، وإدارة الحالة بكفاءة، وتحسين التنقل وإدارة التبعيات. كما تم تحسين واجهة المستخدم وتجربته بتصميم متجاوب وأداء سلس وميزات تفاعلية.",
    "project_nasa": "طوّرت الطبقة الشبكية الكاملة لتطبيق NASA Machine Learning، بما في ذلك جميع تكاملات واجهات البرمجة (APIs) والتحسين وإعداد مكتبة Dio. كما قمت ببناء وتنظيم جميع طبقات الخصائص لضمان معمارية نظيفة وقابلة للتوسع وتدفق بيانات فعّال عبر التطبيق.",
    "mobile_app_development": "بناء تطبيقات جوال عالية الجودة تعمل عبر الأنظمة المختلفة باستخدام Flutter مع تطبيق معمارية نظيفة وإدارة حالة باستخدام Bloc وGetX.",
    "firebase_supabase_integration": "دمج خدمات Firebase وSupabase مثل المصادقة (Authentication)، وFirestore، والتخزين (Storage)، والإشعارات لبناء تطبيقات قابلة للتوسع مدعومة بخوادم خلفية قوية.",
    "ui_ux_design_implementation": "تحويل تصاميم واجهات المستخدم الحديثة (UI/UX) إلى واجهات Flutter متجاوبة مع أنيميشن سلس وأداء ممتاز.",
    "ai_machine_learning_apps": "إنشاء تطبيقات ذكية مدعومة بنماذج الذكاء الاصطناعي وتعلم الآلة، مع دمج ميزات التنبؤ والأتمتة باستخدام Flutter.",
    "About": "نبذة ",
    "Me": "عني",
    "Flutter Developer": "مطوّر Flutter",
    "abuot_info": "أنا مطور Flutter شغوف بإنشاء تطبيقات جوال وويب حديثة وعالية الجودة. أركز على كتابة كود نظيف وقابل للتوسع وعالي الأداء.",
    "See More": "عرض المزيد",
    "Home": "الرئيسية",
    "About Me": "نبذة عني",
    "Service": "الخدمات",
    "Projects": "المشاريع",
    "Contact": "تواصل",
    "HelloItsMe": "مرحبًا، هذا انا ",
    "Khaled Bahnawy" : "خالد بدر",
    "AndImA": "وأنا",
    "FlutterDeveloperTag": "مطور Flutter </>",
    "brief_info": "قادر على تحويل أفكار الأعمال إلى تطبيقات عالية الجودة وقابلة للتوسع باستخدام معماريات مختلفة. أعمل بفعالية ضمن الفرق، وأتبع أفضل الممارسات، وأتعلم باستمرار تقنيات جديدة.",
    "download_cv": "تحميل ال CV",
    "My Services 1" : "خدماتي",
    "My Services 2" : "",
    "Mobile App Development" : "تطبيقات جوال عالية الجودة",
    "Firebase & Supabase Integration" : "دمج خدمات Firebase وSupabase",
    "UI/UX Design Implementation" : "تحويل تصاميم واجهات المستخدم الحديثة",
    "AI & Machine Learning Apps" : "تطبيقات AI وتعلم الآلة",
    "My Projects 1" : "مشاريعي",
    "My Projects 2" : "",
    "hint": "تلميح: اضغط على المشروع لعرضه علي Github",
    "services": "الخدمات",
    "your_name": "اسمك",
    "your_email": "بريدك الإلكتروني",
    "field_empty": "لا يمكن أن يكون الحقل فارغًا",
    "enter_valid_email": "أدخل بريدًا إلكترونيًا صالحًا",
    "your_message": "رسالتك",
    "lets_work_together": "دعنا نعمل معًا",
    "send_message": "إرسال الرسالة"
}